Catalogs/ЗаявкаНаОбразец.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗаявкаНаОбразец</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рецепт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РецептПокрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РецептурыПокрытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Картинки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеКартинка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЗаявкаНаОбразец/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки); 
КонецПроцедуры 


&НаКлиенте
Процедура ВидемостьРецепта()

	Элементы.Рецепт.Видимость 			= НЕ ТочныйРецепт;	
	Элементы.РецептПокрытия.Видимость 	= ТочныйРецепт;	

КонецПроцедуры // ВидемостьРецепта()


#Область Картинки

&НаКлиенте
Процедура ОбщаяКомандаКартинку(Команда)
	//омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ТочныйРецептПриИзменении(Элемент)
	ВидемостьРецепта();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТочныйРецепт = ЗначениеЗаполнено(Объект.РецептПокрытия);
	ВидемостьРецепта();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ТочныйРецепт И НЕ ЗначениеЗаполнено(Объект.РецептПокрытия) Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(, "Не заполнена рецептура");
	
	КонецЕсли;
	
КонецПроцедуры
